Online Book Store/app/controllers/lineitems_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-01 04:35:31.399896"], ["updated_at", "2017-12-01 04:35:31.399896"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 14], ["cart_id", 1], ["created_at", "2017-12-01 04:35:31.432277"], ["updated_at", "2017-12-01 04:35:31.432277"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2017-12-02 05:34:59.578612"], ["id", 6]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)
    #@line_item = @cart.lineitems.build(product: product)
    #@line_item = LineItem.new(line_item_params)
    respond_to do |format|
      if @line_item.save