Online Book Store/app/controllers/orders_controller.rb

  def new
    if @cart.lineitems.empty?
---
SELECT  1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 21], ["LIMIT", 1]]
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 24]]

  def create
    @order = Order.new(order_params)

    @order.add_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aa"], ["address", "asd"], ["email", "asd"], ["paytype", "Credit Card"], ["created_at", "2017-12-02 13:19:32.166935"], ["updated_at", "2017-12-02 13:19:32.166935"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 24]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "address" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["address", "San Jose"], ["updated_at", "2017-12-04 04:17:53.509595"], ["id", 6]]