Online Book Store/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "12"], ["description", "asd"], ["image", "1"], ["price", 22.0], ["created_at", "2017-11-26 07:57:35.467855"], ["updated_at", "2017-11-26 07:57:35.467855"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 11.0], ["updated_at", "2017-11-26 08:01:55.151410"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)