Online Book Store/app/controllers/shopper_controller.rb

  def index
  	if params[:search]
     search_str = "%"+params[:search]+"%"
     res1 = Product.where("name like ?", search_str).order(:name)
     res2 = Product.where("description like ?", search_str).order(:description)
     res3 = Product.where("price like ?", search_str).order(:price)
     searchresult = res1 + res2 + res3
     @products = searchresult.uniq
   else
     @products = Product.order(:name)
---
SELECT "products".* FROM "products" WHERE (name like '%%') ORDER BY "products"."name" ASC
SELECT "products".* FROM "products" WHERE (description like '%%') ORDER BY "products"."description" ASC
SELECT "products".* FROM "products" WHERE (price like '%%') ORDER BY "products"."price" ASC
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC