Online Book Store/app/views/carts/_cart.html.erb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 6]]
---
<table>
	<% @cart.lineitems.each do |item|%>